void main() {
//Operator များ (+,-,*,/,%)

  // int a = 2;
  // int b = 2;

  // print(a + b); //ပေါင်းခြင်း
  // print(a - b); //နှုတ်ခြင်း
  // print(a * b); //မြှောက်ခြင်း
  // print(a / b); //စားခြင်း
  // print(a % b); //စားကြွင်းတွက်ခြင်း

  //Operator များကို တန်ဖိုးပေါင်းထည့်ခြင်း(+=,-=,*=,/= အစားဆို datatype ထည့်ပေးရမည် double,%=)
  // int a = 2;
  // a += 3; // a ၏တန်ဖိုးကို 3 ပေါင်းထည့်ပြီး ပေါင်းထည့်ထားတဲ့တန်ဖိုးကိုပြန်ပြ
  // a -= 3;
  // a *= 3;

  // print(a);

  //(++ကတစ်တိုးသွားမည်),(--ကတစ်လျော့သွားမည်)
  // int a = 1;
  // a++; //a ကိုတစ်ပေါင်းထည့်ခြင်း
  // print(a);

  //ပါဝါရှာခြင်း
  // print(pow(2, 2));
}
